{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "2": "I-PER",
    "3": "B-ORG",
    "4": "I-ORG",
    "5": "B-LOC",
    "6": "I-LOC",
    "7": "B-Archive",
    "8": "I-Archive",
    "9": "B-CelestialObject",
    "10": "I-CelestialObject",
    "11": "B-CelestialObjectRegion",
    "12": "I-CelestialObjectRegion",
    "13": "B-CelestialRegion",
    "14": "I-CelestialRegion",
    "15": "B-Citation",
    "16": "I-Citation",
    "17": "B-Collaboration",
    "18": "I-Collaboration",
    "19": "B-ComputingFacility",
    "20": "I-ComputingFacility",
    "21": "B-Database",
    "22": "I-Database",
    "23": "B-Dataset",
    "24": "I-Dataset",
    "25": "B-EntityOfFutureInterest",
    "26": "I-EntityOfFutureInterest",
    "27": "B-Event",
    "28": "I-Event",
    "29": "B-Fellowship",
    "30": "I-Fellowship",
    "31": "B-Formula",
    "32": "I-Formula",
    "33": "B-Grant",
    "34": "I-Grant",
    "35": "B-Identifier",
    "36": "I-Identifier",
    "37": "B-Instrument",
    "38": "I-Instrument",
    "39": "B-Mission",
    "40": "I-Mission",
    "41": "B-Model",
    "42": "I-Model",
    "43": "B-ObservationalTechniques",
    "44": "I-ObservationalTechniques",
    "45": "B-Observatory",
    "46": "I-Observatory",
    "47": "B-Proposal",
    "48": "I-Proposal",
    "49": "B-Software",
    "50": "I-Software",
    "51": "B-Survey",
    "52": "I-Survey",
    "53": "B-Tag",
    "54": "I-Tag",
    "55": "B-Telescope",
    "56": "I-Telescope",
    "57": "B-TextGarbage",
    "58": "I-TextGarbage",
    "59": "B-URL",
    "60": "I-URL",
    "61": "B-Wavelength",
    "62": "I-Wavelength"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-Archive": 7,
    "B-CelestialObject": 9,
    "B-CelestialObjectRegion": 11,
    "B-CelestialRegion": 13,
    "B-Citation": 15,
    "B-Collaboration": 17,
    "B-ComputingFacility": 19,
    "B-Database": 21,
    "B-Dataset": 23,
    "B-EntityOfFutureInterest": 25,
    "B-Event": 27,
    "B-Fellowship": 29,
    "B-Formula": 31,
    "B-Grant": 33,
    "B-Identifier": 35,
    "B-Instrument": 37,
    "B-LOC": 5,
    "B-Mission": 39,
    "B-Model": 41,
    "B-ORG": 3,
    "B-ObservationalTechniques": 43,
    "B-Observatory": 45,
    "B-PER": 1,
    "B-Proposal": 47,
    "B-Software": 49,
    "B-Survey": 51,
    "B-Tag": 53,
    "B-Telescope": 55,
    "B-TextGarbage": 57,
    "B-URL": 59,
    "B-Wavelength": 61,
    "I-Archive": 8,
    "I-CelestialObject": 10,
    "I-CelestialObjectRegion": 12,
    "I-CelestialRegion": 14,
    "I-Citation": 16,
    "I-Collaboration": 18,
    "I-ComputingFacility": 20,
    "I-Database": 22,
    "I-Dataset": 24,
    "I-EntityOfFutureInterest": 26,
    "I-Event": 28,
    "I-Fellowship": 30,
    "I-Formula": 32,
    "I-Grant": 34,
    "I-Identifier": 36,
    "I-Instrument": 38,
    "I-LOC": 6,
    "I-Mission": 40,
    "I-Model": 42,
    "I-ORG": 4,
    "I-ObservationalTechniques": 44,
    "I-Observatory": 46,
    "I-PER": 2,
    "I-Proposal": 48,
    "I-Software": 50,
    "I-Survey": 52,
    "I-Tag": 54,
    "I-Telescope": 56,
    "I-TextGarbage": 58,
    "I-URL": 60,
    "I-Wavelength": 62,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
